---
title: ExternalResourceLoadData
classe: Autodesk.Revit.DB.ExternalResourceLoadData
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ExternalResourceLoadData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean ErrorsReported { get; set; }` | `externalResourceLoadData.ErrorsReported` | Boolean |
| `ExternalResourceType ExternalResourceType { get; }` | `externalResourceLoadData.ExternalResourceType` | ExternalResourceType |
| `Boolean IsValidObject { get; }` | `externalResourceLoadData.IsValidObject` | Boolean |
| `ExternalResourceLoadStatus LoadStatus { get; }` | `externalResourceLoadData.LoadStatus` | ExternalResourceLoadStatus |
| `Void Dispose()` | `externalResourceLoadData.Dispose()` | Void |
| `ExternalResourceReference GetExternalResourceReference()` | `externalResourceLoadData.GetExternalResourceReference()` | ExternalResourceReference |
| `ExternalResourceLoadContent GetLoadContent()` | `externalResourceLoadData.GetLoadContent()` | ExternalResourceLoadContent |
| `ExternalResourceLoadContext GetLoadContext()` | `externalResourceLoadData.GetLoadContext()` | ExternalResourceLoadContext |
| `Guid GetLoadRequestId()` | `externalResourceLoadData.GetLoadRequestId()` | Guid |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```